app/controllers/photos_managements_controller.rb

SELECT * FROM `photos` WHERE (`photos`.`id` = '1') LIMIT 1
---
  def show
    photo = Photo.find_by_id(params[:id])