app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT * FROM `photos` WHERE (`photos`.user_id = 1 AND (selected = true)) LIMIT 1

  def create
    @photo = Photo.new(params[:photo])
    @photo.user = current_user
    if @photo.save
---
INSERT INTO `photos` (`size`, `content_type`, `thumbnail`, `selected`, `user_id`, `parent_id`, `filename`, `height`, `db_file_id`, `width`) VALUES(276216, 'image/jpeg', NULL, 0, 1, NULL, 'Autumn_Leaves.jpg', 113, NULL, 150)
INSERT INTO `users` (`salt`, `created_at`, `read_only`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `admin`, `enabled`, `remember_token`, `login`, `email`) VALUES('baec684090a9c910a469f796a24fbb6f2f9027cb', '2009-07-20 10:43:55', 0, '42384d478f9fd46ea111bd9608a1b4b446dac7b5', NULL, '2009-07-20 10:43:55', 0, 1, NULL, 'admin', 'admin.email@email.com')